# frozen_string_literal: true

# This file should contain all the record creation needed to seed the database with its default values.
# The data can then be loaded with the bin/rails db:seed command (or created alongside the database with db:setup).
#
# Examples:
#
#   movies = Movie.create([{ name: "Star Wars" }, { name: "Lord of the Rings" }])
#   Character.create(name: "Luke", movie: movies.first)

# Додавання 30 продуктів
=begin
kastruly_p = Product.create([{ name: "Каструля з кришкою 'Майстерня Смаку'",
                               description: 'Ця каструля з нержавіючої сталі має велику місткість і дуже зручна для приготування різних страв.',
                               price: 549.99,
                               quantity: 10 }])

kastruly_skorovarky_p = Product.create([{ name: "Каструля-скороварка 'Скоринка'",
                                          description: 'Ця каструля-скороварка забезпечує швидке приготування страв,зберігаючи їхній смак.',
                                          price: 359.99,
                                          quantity: 5 }])

skovorody_p = Product.create([{ name: "Сковорода 'Політ'",
                                description: 'Ця сковорода з антипригарним покриттям і зручною ручкою стане незамінною річчю в вашій кухні.',
                                price: 229.99,
                                quantity: 20 },
                              { name: "Сковорода-гриль 'Смаковий куток'",
                                description: 'Ця сковорода забезпечує швидке і рівномірне нагрівання для приготування стейків, риби й овочів.',
                                price: 219.99,
                                quantity: 30 },
                              { name: "Сковорідка з антипригарним покриттям 'EasyCook'",
                                description: 'Ця сковорідка дозволяє готувати їжу без жиру та запобігає пригоранню, зберігаючи смак.',
                                price: 79.99,
                                quantity: 25 }
                             ])

nozhi_p = Product.create([{ name: "Ніж для нарізання 'Кулінар'",
                            description: 'Цей ніж зі сталі високої якості дозволяє легко і швидко нарізати різноманітні продукти.',
                            price: 79.99,
                            quantity: 30},
                          { name: "Набір ножів 'Майстерність'",
                            description: 'Цей набір містить різноманітні ножі для нарізання м\'яса, риби, овочів і фруктів.',
                            price: 99.99,
                            quantity: 15 },
                          { name: "Ніж для нарізання сиру 'Сирний майстер'",
                            description: 'Цей ніж дозволяє нарізати сир на тонкі та рівні шматочки, зберігаючи його текстуру та смак.',
                            price: 49.99,
                            quantity: 60 },
                          { name: "Набір ножів для кухні 'ProChef'",
                            description: 'Цей набір містить ножі для нарізання та очищення різноманітних продуктів',
                            price: 179.99,
                            quantity: 15 }
                         ])

kavovarky_p = Product.create([{ name: "Кавоварка 'Чарівна крапля'",
                                description: 'Ця кавоварка з нержавіючої сталі забезпечує швидке і зручне приготування смачної кави.',
                                price: 369.99,
                                quantity: 5 },
                              { name: "Кавоварка 'Моя мрія'",
                                description: 'Ця кавоварка забезпечує приготування смачної та ароматної кави в будь-який момент.',
                                price: 249.99,
                                quantity: 10  }])

chaynyky_p = Product.create([{ name: "Чайник електричний 'Чайна казка'",
                               description: 'Цей чайник забезпечує швидке і зручне приготування гарячого чаю або кави.',
                               price: 119.99,
                               quantity: 15  }])

syta_p = Product.create([{ name: "Сито 'Смачний відбір'",
                           description: 'Це сито з міцної сталі дозволяє легко відокремити відходи від їжі й зберегти цінність продуктів.',
                           price: 84.99,
                           quantity: 50 }])

nabory_p = Product.create([{ name: "Набір кухонних інструментів 'Мій Кухар'",
                             description: 'Цей набір містить ножі, ложки, вилки й інші корисні інструменти для приготування їжі.',
                             price: 129.99,
                             quantity: 100 },
                           { name: "Набір кухонних інструментів 'Елегантність'",
                             description: 'Цей набір кухонних інструментів виготовлений з високоякісної сталі та має приємний дизайн.',
                             price: 129.99,
                             quantity: 35  },
                           { name: "Набір кухонних інструментів 'Все для дому'",
                             description: 'Цей набір містить абсолютно все для абсолютно всіх видів задач в кулінарному мистецтві.',
                             price: 349.99,
                             quantity: 15 }])

terky_p = Product.create([{ name: "Терка 'Смачна ідея'",
                            description: 'Ця терка забезпечує легке і швидке нарізання і натирання різних продуктів.',
                            price: 49.99,
                            quantity: 65 }])

mysky_p = Product.create([{ name: "Набір мисок 'Миска смаку'",
                            description: 'Цей набір містить різноманітні миски для зберігання продуктів і приготування різних страв.',
                            price: 109.99,
                            quantity: 30 }])

kombayny_p = Product.create([{ name: "Кухонний комбайн 'Майстер Кухар'",
                               description: 'Цей комбайн дозволяє швидко і легко нарізати, натерти й змішати різні продукти.',
                               price: 799.99,
                               quantity: 20 }])

plyty_p = Product.create([{ name: "Плита електрична 'Гаряча точка'",
                            description: 'Ця плита забезпечує швидке і рівномірне нагрівання ідеальне для приготування різноманітних страв.',
                            price: 84.99,
                            quantity: 50 }])

blendery_p = Product.create([{ name: "Блендер 'Кухонний маг'",
                               description: 'Цей блендер дозволяє швидко і легко змішувати й розмелювати різні продукти.',
                               price: 139.99,
                               quantity: 30 }])

myltyfarky_p = Product.create([{ name: "Мультиварка 'Мультикухар'",
                                 description: 'Ця мультиварка дозволяє готувати різні страви на пару, тушкувати, смажити й т.д.',
                                 price: 799.99,
                                 quantity: 10 },
                               { name: "Мультиварка 'Помічник'",
                                 description: 'Ця мультиварка має різні режими приготування, що дозволяє зекономити час та експерементувати.',
                                 price: 799.99,
                                 quantity: 10 }])

timers_p = Product.create([{ name: "Кухонний таймер 'Час приготування'",
                             description: 'Цей таймер дозволяє точно відстежувати час приготування їжі та запобігає її перепіканню.',
                             price: 149.99,
                             quantity: 20 }])

forms_p = Product.create([{ name: "Форма для запікання 'Смакота'",
                            description: 'Ця форма з нержавіючої сталі дозволяє приготувати різні запіканки й десерти.',
                            price: 25.99,
                            quantity: 200 },
                          { name: "Форма для випічки 'Солодкий дім'",
                            description: 'Ця форма забезпечує рівномірне пекарство ідеальне для приготування різних видів хліба і пирогів.',
                            price: 29.99,
                            quantity: 80 },
                          { name: "Набір форм для запікання 'Кулінарна фантазія'",
                            description: 'Цей набір містить форми різних розмірів та форм для запікання різноманітних страв.',
                            price: 99.99,
                            quantity: 20 },
                          { name: "Форма для запікання 'Твоє - все!'",
                            description: 'Ця форма ідеальна для запікання різних видів страв, зберігаючи їхній аромат і смак.',
                            price: 39.99,
                            quantity: 35 }])

kelyhy_p = Product.create([{ name: "Келихи для вина 'Винна галявина'",
                             description: 'Ці келихи забезпечують правильну подачу і зберігання вина, зберігаючи його аромат і смак.',
                             price: 69.99,
                             quantity: 50  },
                           { name: "Келихи для шампанського 'Вишуканість'",
                             description: 'Ці келихи створені спеціально для правильної подачі та насолоди від шампанського.',
                             price: 89.99,
                             quantity: 40 }])
=end

# Додавання 5 знижок
=begin
5.times do
  Discount.create(
    product_id: rand(1..10),
    percent: rand(5..30),
    start_date: Faker::Date.between(from: 6.months.ago.to_s, to: Date.today),
    end_date: Faker::Date.between(from: Date.tomorrow, to: 6.months.from_now.to_s)
  )
end
=end

# Додавання категорій та підкатегорій
=begin
# Посуд
posud = Category.create(name: "Посуд", parent_id: nil, description: "Все необхідне для приготування їжі")
  # Каструлі
  kastulya = Category.create(name: "Каструлі", parent_id: posud.id, description: "Для звичайного приготування їжі")
  # Каструлі скороварки
  skorovarka = Category.create(name: "Каструлі скороварки", parent_id: posud.id, description: "Для швидкого приготування їжі")
  # Сковороди
  skovorda = Category.create(name: "Сковороди", parent_id: posud.id, description: "Для смаження їжі на різній основі")
  # Ножі
  nozh = Category.create(name: "Ножі", parent_id: posud.id, description: "Для різання продуктів")

# Для чаю та кави
chay_kava = Category.create(name: "Для чаю та кави", parent_id: nil, description: "Все необхідне для приготування чаю та кави")
  # Кавоварки
  kavovarka = Category.create(name: "Кавоварки", parent_id: chay_kava.id, description: "Для приготування кави")
  # Чайники
  chaynyk = Category.create(name: "Чайники", parent_id: chay_kava.id, description: "Для приготування чаю")

# Кухонне приладдя
priladdya = Category.create(name: "Кухонне приладдя", parent_id: nil, description: "Інструменти для приготування їжі")
  # Сита
  sita = Category.create(name: "Сита", parent_id: priladdya.id, description: "Для просіювання муки та інших сипучих продуктів")
  # Набори інструментів
  nabir = Category.create(name: "Набори інструментів", parent_id: priladdya.id, description: "Комплекти інструментів для різних видів робіт")
  # Терки
  terka = Category.create(name: "Терки", parent_id: priladdya.id, description: "Для тертя продуктів")
  # Миски
  miska = Category.create(name: "Миски", parent_id: priladdya.id, description: "Для зберігання та змішування інгредієнтів")

# Побутова техніка
tehnika = Category.create(name: "Побутова техніка", parent_id: nil, description: "Електронні пристрої для приготування їжі")
  # Кухонні комбайни
  kombayn = Category.create(name: "Кухонні комбайни", parent_id: tehnika.id, description: "Для змішування, різання та перемішування інгредієнтів")
  # Плити
  plyta = Category.create(name: "Плити", parent_id: tehnika.id, description: "Для приготування їжі на вогні")
  # Блендери
  blender = Category.create(name: "Блендери", parent_id: tehnika.id, description: "Для змішування та подрібнення інгредієнтів")
  # Мультиварки
  mulvarka = Category.create(name: "Мультиварки", parent_id: tehnika.id, description: "Для приготування їжі в автоматичному режимі")
  # Кухонні таймери
  taymer = Category.create(name: "Кухонні таймери", parent_id: tehnika.id, description: "Для вимірювання часу приготування їжі")

# Аксесуари для кухні
aksesuary = Category.create(name: "Аксесуари для кухні", parent_id: nil, description: "Різні аксесуари для приготування їжі")
  # Форми для запікання і випічки
  forma = Category.create(name: "Форми для запікання і випічки", parent_id: aksesuary.id, description: "Для приготування випічки та запікання страв")

# Келихи і фужери
kelih = Category.create(name: "Келихи і фужери", parent_id: nil, description: "Різні види склянок для напоїв")
=end

# Додавання в categories_products
=begin
categories = {
  "Каструлі" => kastruly_p,
  "Каструлі скороварки" => kastruly_skorovarky_p,
  "Сковороди" => skovorody_p,
  "Ножі" => nozhi_p,
  "Кавоварки" => kavovarky_p,
  "Чайники" => chaynyky_p,
  "Сита" => syta_p,
  "Набори інструментів" => nabory_p,
  "Терки" => terky_p,
  "Миски" => mysky_p,
  "Кухонні комбайни" => kombayny_p,
  "Плити" => plyty_p,
  "Блендери" => blendery_p,
  "Мультиварки" => myltyfarky_p,
  "Кухонні таймери" => timers_p,
  "Форми для запікання і випічки" => forms_p,
  "Келихи і фужери" => kelyhy_p
}

categories.each do |category_name, products|
  category = Category.find_by(name: category_name)
  products.each do |product|
    product.categories.append(category)
  end
end
=end

# Додавання характеристик
=begin
attributes_names = ["Виробник", "Матеріал", "Місткість", "Довжина леза",
                    "Гарантія", "Розміри", "Вага"]
attributes_names.each do |name|
  Attribute.create(name: name)
end
=end

# Додавання характеристик_продуктів
=begin
data = [
  "Каструля з кришкою 'Майстерня Смаку'",
  "Каструля-скороварка 'Скоринка'",
  "Сковорода 'Політ'",
  "Сковорода-гриль 'Смаковий куток'",
  "Сковорідка з антипригарним покриттям 'EasyCook'",
  "Ніж для нарізання 'Кулінар'",
  "Набір ножів 'Майстерність'",
  "Ніж для нарізання сиру 'Сирний майстер'",
  "Набір ножів для кухні 'ProChef'",
  "Кавоварка 'Чарівна крапля'",
  "Кавоварка 'Моя мрія'",
  "Чайник електричний 'Чайна казка'",
  "Сито 'Смачний відбір'",
  "Набір кухонних інструментів 'Мій Кухар'",
  "Набір кухонних інструментів 'Елегантність'",
  "Набір кухонних інструментів 'Все для дому'",
  "Терка 'Смачна ідея'",
  "Набір мисок 'Миска смаку'",
  "Кухонний комбайн 'Майстер Кухар'",
  "Плита електрична 'Гаряча точка'",
  "Блендер 'Кухонний маг'",
  "Мультиварка 'Мультикухар'",
  "Мультиварка 'Помічник'",
  "Кухонний таймер 'Час приготування'",
  "Форма для запікання 'Смакота'",
  "Форма для випічки 'Солодкий дім'",
  "Набір форм для запікання 'Кулінарна фантазія'",
  "Форма для запікання 'Твоє - все!'",
  "Келихи для вина 'Винна галявина'",
  "Келихи для шампанського 'Вишуканість'"
]

attributes_names = [
  "Виробник",
  "Матеріал",
  "Місткість",
  "Довжина леза",
  "Гарантія",
  "Розміри",
  "Вага"]

attributes_values= [
  { producer:   "Tefal",
    material:   "Алюміній",
    capacity:   "3 літри",
    b_length:     nil,
    guarantee:  "1 рік" ,
    size:       "25 см x 25 см x 15 см",
    weight:     "1.5 кг" },
  { producer:   "Fissler",
    material:   "Нержавіюча сталь",
    b_length:     nil,
    capacity:   "2 літри",
    guarantee:  "2 роки" ,
    size:       "30 см x 30 см x 20 см",
    weight:     "2.5 кг" },
  { producer:   "Berghoff",
    material:   "Кераміка",
    capacity:   "1.66 літри",
    b_length:     nil,
    guarantee:  "2 роки" ,
    size:       "28 см x 28 см x 5 см",
    weight:     "1 кг" },
  { producer:   "Tefal",
    material:   "Алюміній з антипригарним покриттям",
    capacity:   "1.86 літри",
    b_length:     nil,
    guarantee:  "2 роки" ,
    size:       "30 см x 20 см x 5 см",
    weight:     "1.5 кг" },
  { producer:   "GreenPan",
    material:   "Алюміній з керамічним антипригарним покриттям",
    capacity:   "1 літр",
    b_length:     nil,
    guarantee:  "2.5 роки" ,
    size:       "20 см x 20 см x 4 см",
    weight:     "0.5 кг" },

  { producer:   "Fiskars",
    material:   "Нержавіюча сталь",
    capacity:   nil,
    b_length:   "170 мм",
    guarantee:  "2 роки" ,
    size:       "12 x 1 дюйм",
    weight:     "0.2 кг" },
  { producer:   "Zwilling J.A. Henckels",
    material:   "Сталь",
    capacity:   nil,
    b_length:   "від 110 мм до 170 мм",
    guarantee:  "4.5 роки" ,
    size:       "від 12 x 1 дюймів до 18 x 1 дюймів",
    weight:     "від 0.5 кг до 2 кг" },
  { producer:   "Boska",
    material:   "Нержавіюча сталь",
    capacity:   nil,
    b_length:   "120 мм",
    guarantee:  "2.5 роки" ,
    size:       "9.5 x 1.2 дюйма",
    weight:     "0.3 кг" },
  { producer:   "Victorinox",
    material:   "Нержавіюча сталь",
    capacity:   nil,
    b_length:   "від 125 мм до 180 мм",
    guarantee:  "5 років" ,
    size:       "від 11 x 1 дюймів до 17 x 1.2 дюймів",
    weight:     "від 0.2 кг до 1.7 кг" },
  { producer:   "Bialetti",
    material:   "Алюміній",
    capacity:   "0.8 літрa",
    b_length:   nil,
    guarantee:  "2.5 роки" ,
    size:       "40 см x 30 см x 25 см",
    weight:     "3.5 кг" },

  { producer:   "DeLonghi",
    material:   "Нержавіюча сталь",
    capacity:   "1 літр",
    b_length:   nil,
    guarantee:  "3 роки" ,
    size:       "55 см x 45 см x 35 см",
    weight:     "7.5 кг" },
  { producer:   "Philips",
    material:   "Сталь",
    capacity:   "1.5 літра",
    b_length:   nil,
    guarantee:  "2 роки" ,
    size:       "35 см x 25 см x 25 см",
    weight:     "2 кг" },
  { producer:   "OXO",
    material:   "Нержавіюча сталь",
    capacity:   nil,
    b_length:   nil,
    guarantee:  "1 рік" ,
    size:       "35 см",
    weight:     "0.2 кг" },
  { producer:   "KitchenAid",
    material:   "Нержавіюча сталь",
    capacity:   nil,
    b_length:   nil,
    guarantee:  "5 років" ,
    size:       "Розміри залежать від бажань клієнта",
    weight:     "Вага залежить від бажання клієнта" },
  { producer:   "Cuisinart",
    material:   "Алюміній",
    capacity:   nil,
    b_length:   nil,
    guarantee:  "2.5 роки" ,
    size:       "Розміри залежать від бажань клієнта",
    weight:     "Вага залежить від бажання клієнта" },

  { producer:   "Cuisinart",
    material:   "Алюміній",
    capacity:   nil,
    b_length:   nil,
    guarantee:  "1.5 роки" ,
    size:       "5 см x 5 см x 3 см до 20 см x 20 см x 5 см",
    weight:     "від 0.5 кг до 2 кг" },
  { producer:   "GreenPan",
    material:   "Сталь",
    capacity:   nil,
    b_length:   nil,
    guarantee:  "2 роки" ,
    size:       "25 см x 15 см x 5 см",
    weight:     "1.5 кг" },
  { producer:   "Pyrex",
    material:   "Сталь",
    capacity:   nil,
    b_length:   nil,
    guarantee:  "2 роки" ,
    size:       "від 15 см до 35 см",
    weight:     "від 0.2 кг до 0.4 кг" },
  { producer:   "Bosch",
    material:   "Пластик, метал",
    capacity:   "2 літри",
    b_length:   nil,
    guarantee:  "2 роки" ,
    size:       "39 см x 23 см x 29 см",
    weight:     "4 кг" },
  { producer:   "Electrolux",
    material:   "Кераміка",
    capacity:   nil,
    b_length:   nil,
    guarantee:  "3 роки" ,
    size:       "5 х 59 х 52 см",
    weight:     "10 кг"},

  { producer:   "Tupperware",
    material:   "Пластик",
    capacity:   "1 літр",
    guarantee:  "1 рік" ,
    size:       "20 см x 20 см x 10 см",
    weight:     "0.4 кг" },
  { producer:   "WMF",
    material:   "Нержавіюча сталь",
    capacity:   "3 літри",
    guarantee:  "2 роки" ,
    size:       "26 см x 26 см x 14 см",
    weight:     "2 кг" },
  { producer:   "Kuhn Rikon",
    material:   "Алюміній з керамічним антипригарним покриттям",
    capacity:   "1.5 літри",
    guarantee:  "2 роки" ,
    size:       "20 см x 26 см x 14 см",
    weight:     "1.5 кг" },
  { producer:   "Oven",
    material:   "Нержавіюча сталь",
    capacity:   nil,
    b_length:   nil,
    guarantee:  "2 роки" ,
    size:       "7 х 4 х 8 см",
    weight:     "0.5 кг" },
  { producer:   "Ardesto Gemini",
    material:   "Вуглецева сталь",
    capacity:   nil,
    b_length:   nil,
    guarantee:  "1 місяць" ,
    size:       "23.2 x 22 x 5 см ",
    weight:     "1 кг"},

  { producer:   "Luminarc Smart Cuisine",
    material:   "Пластик",
    capacity:   nil,
    b_length:   nil,
    guarantee:  "1 рік" ,
    size:       "38х27 см",
    weight:     "0.5 кг" },
  { producer:   "Luminarc Smart Cuisine",
    material:   "Нержавіюча сталь",
    capacity:   nil,
    b_length:   nil,
    guarantee:  "2 роки" ,
    size:       "Розміри залежать від бажань клієнта",
    weight:     "Вага залежить від бажання клієнта" },
  { producer:   "Santex",
    material:   "Антипригарне силіконове покриття",
    capacity:   "0.5 літри",
    guarantee:  "2 роки",
    size:       "Розміри залежать від бажань клієнта",
    weight:     "Вага залежить від бажання клієнта" },
  { producer:   "Royal Leerdam",
    material:   "Кришталеве скло",
    capacity:   "0.3 літри",
    guarantee:  "10 років",
    size:       "5 см x 5 см x 22 см",
    weight:     "0.4 кг" },
  { producer:   "Bohemia Crystal",
    material:   "Кришталеве скло",
    capacity:   "0.15 літри",
    guarantee:  "5 років",
    size:       "6 см x 6 см x 20 см",
    weight:     "0.3 кг" }
]

data.each_with_index do |data_name, index|
  prod = Product.find_by(name: data_name)
  attributes_names.each do |name_category|
    attrib = Attribute.find_by(name: name_category)
    value = case attrib.name
            when "Виробник"
              attributes_values[index][:producer]
            when "Матеріал"
              attributes_values[index][:material]
            when "Місткість"
              attributes_values[index][:capacity]
            when "Довжина леза"
              attributes_values[index][:b_length]
            when "Гарантія"
              attributes_values[index][:guarantee]
            when "Розміри"
              attributes_values[index][:size]
            when "Вага"
              attributes_values[index][:weight]
            end

    AttributesProduct.create!(attribute_id: attrib.id, product_id: prod.id, value: value)
  end
  puts index + 1
end
=end

# Додавання юзерів
=begin
require 'faker'
Faker::Config.locale = 'uk'
100.times do
  gender = Faker::Gender.binary_type.downcase
  first_name = Faker::Name.send("#{gender}_first_name")
  patron = Faker::Name.send(:male_first_name)
  patronymic = "#{patron}#{gender == 'female' ? 'івна' : 'ович'}"
  user = User.new(
    name: first_name,
    surname: Faker::Name.last_name,
    patronymic: patronymic,
    email: Faker::Internet.email,
    password: '123456',
    password_confirmation: '123456'
  )
  user.save!
end
=end

# Додавання відгуків
=begin
reviews = {
  "Каструля з кришкою 'Майстерня Смаку'" => [ "Я дуже задоволена своєю новою каструлею 'Майстерня Смаку'. Вона має високу якість виготовлення та ідеально підходить для приготування їжі на газовій плиті.",
                                              "Це найкраща каструля, яку я коли-небудь купував. Вона дуже легка та проста у використанні, а також має надійну кришку, щоб запобігти витоку пари.",
                                              "Я захоплений каструлею 'Майстерня Смаку'. Вона має високу якість виготовлення та досить велику ємність, щоб помістити достатньо їжі для моєї сім'ї."],
  "Каструля-скороварка 'Скоринка'"=> ["Каструля-скороварка 'Скоринка' - чудовий кухонний прилад для будь-якої господині. Завдяки її високій якості та зручному дизайну приготування стає ще простішим та швидшим. Рекомендую!",
                                      "Каструля-скороварка 'Скоринка' - прекрасний вибір для кожної господині! Вона дозволяє готувати страви швидко та ефективно, зберігаючи всі корисні властивості продуктів.",
                                      "З 'Скоринкою' готування стало ще простіше та швидше! Ця каструля-скороварка дозволяє приготувати смачні страви за кілька хвилин, зберігаючи всі корисні властивості продуктів."],
  "Сковорода 'Політ'" => ["Сковорода 'Політ' - чудовий помічник у кулінарному процесі. Вона рівномірно розподіляє тепло, дозволяючи отримати ідеально смажені страви.",
                          "Сковорода 'Політ' - надійний помічник у кулінарному процесі. Її можна використовувати на будь-яких плитах, а рівномірне розподілення тепла дозволяє отримати ідеально смажені страви."],
  "Сковорода-гриль 'Смаковий куток'" => ["Сковорода-гриль 'Смаковий куток' - прекрасний варіант для любителів смачного та здорового харчування. З її допомогою можна приготувати смачне м'ясо, рибу та овочі без використання жиру.",
                                         "Сковорода-гриль 'Смаковий куток' - незамінний атрибут будь-якого барбекю! З її допомогою можна приготувати смачне м'ясо, рибу та овочі без використання жиру та отримати неперевершений смак.",
                                         "Сковорода-гриль 'Смаковий куток' - просто вишукана! З нею приготування стейків та овочів стає простим і швидким. Якість матеріалів на висоті, антипригарне покриття не псується при довготривалому використанні. Рекомендую!"],
  "Сковорідка з антипригарним покриттям 'EasyCook'" => ["Сковорідка з антипригарним покриттям 'EasyCook' - ідеальний вибір для тих, хто цінує свій час та здоров'я. Завдяки антипригарному покриттю, її легко мити та вона не потребує використання багато жиру.",
                                                        "Сковорідка з антипригарним покриттям 'EasyCook' - це просто мрія для кухаря! Нічого не пригорає, готувати стає набагато приємніше. Зручна ручка і необхідний розмір - все, що потрібно для ідеального досвіду готування."],

  "Ніж для нарізання 'Кулінар'" => ["Ніж для нарізання 'Кулінар' - дуже гострий та зручний у використанні. Підходить для нарізання будь-яких продуктів, від м'яса до фруктів. Я задоволена своїм вибором!",
                                    "Ніж для нарізання 'Кулінар' - найкращий помічник в кулінарному мистецтві! Гостре лезо дозволяє швидко і легко нарізати будь-які продукти, навіть найтвердіший хліб чи м'ясо. Рекомендую!"],
  "Набір ножів 'Майстерність'"=> ["Набір ножів 'Майстерність' - це все, що потрібно для кухні. Різні типи ножів забезпечують зручність в різних ситуаціях. Ідеальний варіант для будь-якої господині!",
                                  "Набір ножів 'Майстерність' - це справжнє диво! Якість ножів вразила мене з першого ж же стосунку. Гострість леза і зручна ручка дозволяють легко керувати ножем і зробити кулінарний процес ще приємнішим."],
  "Ніж для нарізання сиру 'Сирний майстер'" => ["Ніж для нарізання сиру 'Сирний майстер' - незамінний помічник у кулінарному процесі. Сири нарізаються дуже легко і швидко, а результат виходить ідеальним. Рекомендую всім любителям сиру!"],
  "Набір ножів для кухні 'ProChef'" => ["Набір ножів для кухні 'ProChef' - дуже якісний продукт. Ножі гострі і зручні в руці, що дозволяє швидко і легко нарізати будь-які продукти. Варто зазначити, що дизайн ножів виглядає дуже стильно і сучасно.",
                                        "Набір ножів для кухні 'ProChef' - ідеальний варіант для професійних кухарів та просто любителів готування. Гострість леза і зручна форма ручки дозволяють швидко та легко нарізати будь-які продукти. Я в захваті!"],
  "Кавоварка 'Чарівна крапля'" => ["Кавоварка 'Чарівна крапля' - найкращий вибір для справжнього любителя кави. Завдяки спеціальній технології кава виходить ідеальним смаком та ароматом. Кавоварка проста в експлуатації і має красивий дизайн, який чудово підійде для будь-якої кухні.",
                                   "Кавоварка 'Чарівна крапля' - це дійсно магічна машина, яка готує чудову каву за декілька хвилин! Зручне управління і компактний дизайн дозволяють легко використовувати цю кавоварку вдома або на роботі. Раджу всім, хто цінує смачну каву і зручність в приготуванні!",
                                   "Кавоварка 'Чарівна крапля' - це дійсно магічна машина, яка готує чудову каву за декілька хвилин! Зручне управління і компактний дизайн дозволяють легко використовувати цю кавоварку вдома або на роботі. Раджу всім, хто цінує смачну каву і зручність в приготуванні!"],

  "Кавоварка 'Моя мрія'" => ["Кавоварка 'Моя мрія' - це справжнє задоволення для кавоманів! Швидке приготування кави, зручний дизайн і просте управління - все це робить цю кавоварку ідеальним варіантом для дому або офісу. Рекомендую всім, хто любить смачну каву!",
                             "Кавоварка 'Моя мрія' - просто неймовірна! Якість кави на вищому рівні, а ще й дуже зручна у використанні. Рекомендую всім любителям смачної кави!"],
  "Чайник електричний 'Чайна казка'" => ["Чайник електричний 'Чайна казка' - це прекрасний вибір для любителів чаю! Швидке нагрівання води, елегантний дизайн і зручне управління - все це робить цей чайник незамінним на кухні. Рекомендую всім, хто любить чай!",
                                         "Чайник електричний 'Чайна казка' - це просто казка для чайних поціновувачів! Зручний у використанні, швидко нагріває воду, а ще має стильний дизайн. Рекомендую!"],
  "Сито 'Смачний відбір'"=> [],
  "Набір кухонних інструментів 'Мій Кухар'"=> ["Набір кухонних інструментів 'Мій Кухар' - це дійсно все, що потрібно для комфортного приготування їжі. Якісні матеріали і зручна форма дозволяють легко виконувати будь-які кулінарні операції. Рекомендую всім, хто любить готувати!"],
  "Набір кухонних інструментів 'Елегантність'"=> ["Набір кухонних інструментів 'Елегантність' - дійсно елегантний інструмент для тих, хто любить приготування їжі. Кожен інструмент має свій унікальний дизайн і забезпечує високу якість роботи. Раджу всім, хто хоче зробити свою кухню ще більш елегантною!",
                                                  "Набір кухонних інструментів 'Елегантність' - це просто дивовижна колекція, яка підійде до будь-якої кухні! Інструменти мають елегантний дизайн і високу якість. Рекомендую всім!"],


  "Набір кухонних інструментів 'Все для дому'" => ["Набір кухонних інструментів 'Все для дому' - це абсолютний безглуздий витрати грошей. Якість предметів варта їхньої ціни у 3 рази менше, і вони швидко ламаються.",
                                                   "Набір кухонних інструментів 'Все для дому' - це повна втрата грошей. Всі інструменти низької якості, і їхнє використання становить ризик для вашої безпеки. Я не рекомендую купувати цей продукт нікому."],
  "Терка 'Смачна ідея'" => ["Терка 'Смачна ідея' - це просто жахливо. Вона не працює як треба, і ріжки затуплюються після першого використання. Нікому не рекомендую."],
  "Набір мисок 'Миска смаку'"=> ["Набір мисок 'Миска смаку' - це зразок низької якості. Вони почали тріскатися після першого використання, а їхні форми стали неправильними. І не говорячи про те, що вони не миються добре.",
                                 "Набір мисок 'Миска смаку' - це неприємна річ. Миски дуже легко ламаються, і вони не миються добре. Крім того, їхні форми неправильні, і їхні краї дуже гострі. Цей продукт не вартує своєї ціни."],
  "Кухонний комбайн 'Майстер Кухар'"=> ["Кухонний комбайн 'Майстер Кухар' - це найгірший комбайн, який я коли-небудь використовував. Він шумить, як літак, і його неможливо налаштувати на потрібну швидкість. Крім того, він дуже важкий і незручний у використанні.",
                                        "Кухонний комбайн 'Майстер Кухар' - це повна недолік. Він шумить так сильно, що його неможливо використовувати в будь-якому побутовому середовищі. Крім того, його часто поламалися, і його було дуже важко починити. Не витрачайте свої гроші на цей продукт."],
  "Плита електрична 'Гаряча точка'"=> ["Плита електрична 'Гаряча точка' - це знущання над клієнтом. Вона не нагрівається рівномірно, і навіть при найвищій температурі, їжа не готується швидко. Крім того, її складно очистити, і вона стає дуже гарячою на дотик. Не рекомендую купувати цей продукт.",
                                       "Плита електрична 'Гаряча точка' - це просто жах. Її температура не може бути налаштована, і вона не нагрівається достатньо швидко. Крім того, її ручки дуже гарячі на дотик, і її було дуже важко очистити. Цей продукт є повною втратою грошей."],

  "Блендер 'Кухонний маг'"=> ["Блендер 'Кухонний маг' - це просто жахлива річ! Я витратив багато грошей на цей блендер, але він працює настільки погано, що я не можу нічого змішати без того, щоб все не вилетіло з нього.",
                              "Блендер 'Кухонний маг' - це абсолютний брехун! Він виглядає краще, ніж насправді є. Він не працює належним чином, і я постійно забруднюю свою кухню, коли використовую його."],
  "Мультиварка 'Мультикухар'"=> ["Мультиварка 'Мультикухар' - найгірша покупка, яку я коли-небудь робив. Вона постійно ламається, і кожного разу, коли я хочу приготувати щось в ній, вона просто зупиняється.",
                                 "Мультиварка 'Мультикухар' - це просто жахлива річ! Вона не працює належним чином, і я постійно витрачаю години на очікування, коли вона закінчить приготування моєї їжі.",
                                 "Мультиварка 'Мультикухар' - це найгірша річ, яку я коли-небудь купував. Вона постійно ламається, і я постійно тратжу свій час і гроші на її ремонт. Я розчарований цією покупкою."],
  "Мультиварка 'Помічник'"=> ["Мультиварка 'Помічник' - це нічого іншого, як розчарування. Вона виглядає красиво, але не працює належним чином. Їжа не готується рівномірно, і я постійно отримую неприємні сюрпризи.",
                              "Мультиварка 'Помічник' - це просто втрата грошей! Вона не працює належним чином, і я постійно отримую погані результати приготування їжі. Я не рекомендую цю річ нікому."],
  "Кухонний таймер 'Час приготування'"=> ["Кухонний таймер 'Час приготування' - це абсолютна втрата грошей. Він просто не працює, і я постійно пропускаю час приготування моєї їжі.",
                                          "Кухонний таймер 'Час приготування' - це абсолютна провальна покупка! Він не працює належним чином, і я постійно отримую неправильні часи приготування своєї їжі."],
  "Форма для запікання 'Смакота'"=> ["Форма для запікання 'Смакота' - це жахлива річ! Я зробив все, що вказано в інструкції, але моя їжа все одно не випеклася належним чином. Я розчарований цією покупкою."],

  "Форма для випічки 'Солодкий дім'"=> ["Форма для випічки 'Солодкий дім' - це просто катастрофа! Мінімалістичний дизайн, але не функціональний. Вона не зберігає форму і тісто з неї випадає. Не рекомендую!",
                                        "Форма для випічки 'Солодкий дім' - це ніщо інше, як провал! Форма не зберігає форму і при випічці стає м'якою. Вона не є надійною і дуже незручною у використанні. Не купуйте цю форму!"],
  "Набір форм для запікання 'Кулінарна фантазія'"=> ["Набір форм для запікання 'Кулінарна фантазія' - це жахлива якість за таку високу ціну! Форми дуже тонкі і недоліків багато. Не варто грошей, краще купити щось інше.",
                                                     "Набір форм для запікання 'Кулінарна фантазія' - це справжній кримінал! Вони тріскаються при першому же використанні, і зовсім не є практичними. Ціна на ці форми - це абсолютний обман."],
  "Форма для запікання 'Твоє - все!'"=> ["Форма для запікання 'Твоє - все!' - це абсолютна втрата грошей. На перший погляд виглядає привабливо, але функціональність залишає бажати кращого. Тісто пригорає і форма не є легкою в чистці."],
  "Келихи для вина 'Винна галявина'"=> ["Келихи для вина 'Винна галявина' - це така жахлива річ! Вони тріскаються при першому же використанні і не мають жодного шарму. Забудьте про ці келихи і купіть щось інше.",
                                        "Келихи для вина 'Винна галявина' - це абсолютно безглуздий вибір! Вони тріскаються при найменшому ударі і не є практичними у використанні. Ціна на них також дуже завищена."],
  "Келихи для шампанського 'Вишуканість'"=> ["Келихи для шампанського 'Вишуканість' - це найгірший вибір, який я коли-небудь робив! Вони зовсім не елегантні і незручні у використанні. Якість за таку ціну - це абсолютний обман."]
}

rat = 0
reviews.each do |prod, data|
  product = Product.find_by(name: prod)
  data.each do |x|
    rating = (rat > 15) ? rand(0..3) : rand(4..5)
    Review.create!(user_id: rand(0..99), product_id: product.id, rating: rating, comment: x)
  end
  rat += 1
end
=end
