# frozen_string_literal: true

# This file should contain all the record creation needed to seed the database with its default values.
# The data can then be loaded with the bin/rails db:seed command (or created alongside the database with db:setup).
#
# Examples:
#
#   movies = Movie.create([{ name: "Star Wars" }, { name: "Lord of the Rings" }])
#   Character.create(name: "Luke", movie: movies.first)

# Додавання 20 продуктів
=begin
products = [
  { name: "Каструля з кришкою 'Майстерня Смаку'",
    description: 'Ця каструля з нержавіючої сталі має велику місткість і дуже зручна для приготування різних страв.',
    price: 549.99,
    quantity: 10 },
  { name: "Сковорода 'Політ'",
    description: 'Ця сковорода з антипригарним покриттям і зручною ручкою стане незамінною річчю в вашій кухні.',
    price: 229.99,
    quantity: 20 },
  { name: "Ніж для нарізання 'Кулінар'",
    description: 'Цей ніж зі сталі високої якості дозволяє легко і швидко нарізати різноманітні продукти.',
    price: 79.99,
    quantity: 30 },
  { name: "Кавоварка 'Чарівна крапля'",
    description: 'Ця кавоварка з нержавіючої сталі забезпечує швидке і зручне приготування смачної кави.',
    price: 369.99,
    quantity: 5 },
  { name: "Сито 'Смачний відбір'",
    description: 'Це сито з міцної сталі дозволяє легко відокремити відходи від їжі й зберегти цінність продуктів.',
    price: 84.99,
    quantity: 50 },

  { name: "Кухонний комбайн 'Майстер Кухар'",
    description: 'Цей комбайн дозволяє швидко і легко нарізати, натерти й змішати різні продукти.',
    price: 799.99,
    quantity: 20 },
  { name: "Набір кухонних інструментів 'Мій Кухар'",
    description: 'Цей набір містить ножі, ложки, вилки й інші корисні інструменти для приготування їжі.',
    price: 129.99,
    quantity: 100 },
  { name: "Плита електрична 'Гаряча точка'",
    description: 'Ця плита забезпечує швидке і рівномірне нагрівання ідеальне для приготування різноманітних страв.',
    price: 84.99,
    quantity: 50 },
  { name: "Форма для запікання 'Смакота'",
    description: 'Ця форма з нержавіючої сталі дозволяє приготувати різні запіканки й десерти.',
    price: 25.99,
    quantity: 200 },
  { name: "Блендер 'Кухонний маг'",
    description: 'Цей блендер дозволяє швидко і легко змішувати й розмелювати різні продукти.',
    price: 139.99,
    quantity: 30 },

  { name: "Чайник електричний 'Чайна казка'",
    description: 'Цей чайник забезпечує швидке і зручне приготування гарячого чаю або кави.',
    price: 119.99,
    quantity: 15 },
  { name: "Терка 'Смачна ідея'",
    description: 'Ця терка забезпечує легке і швидке нарізання і натирання різних продуктів.',
    price: 49.99,
    quantity: 65 },
  { name: "Сковорода-гриль 'Смаковий куток'",
    description: 'Ця сковорода забезпечує швидке і рівномірне нагрівання для приготування стейків, риби й овочів.',
    price: 219.99,
    quantity: 30 },
  { name: "Мультиварка 'Мультикухар'",
    description: 'Ця мультиварка дозволяє готувати різні страви на пару, тушкувати, смажити й т.д.',
    price: 799.99,
    quantity: 10 },
  { name: "Набір ножів 'Майстерність'",
    description: 'Цей набір містить різноманітні ножі для нарізання м\'яса, риби, овочів і фруктів.',
    price: 99.99,
    quantity: 15 },

  { name: "Келихи для вина 'Винна галявина'",
    description: 'Ці келихи забезпечують правильну подачу і зберігання вина, зберігаючи його аромат і смак.',
    price: 69.99,
    quantity: 50 },
  { name: "Форма для випічки 'Солодкий дім'",
    description: 'Ця форма забезпечує рівномірне пекарство ідеальне для приготування різних видів хліба і пирогів.',
    price: 29.99,
    quantity: 80 },
  { name: "Кухонний таймер 'Час приготування'",
    description: 'Цей таймер дозволяє точно відстежувати час приготування їжі та запобігає її перепіканню.',
    price: 149.99,
    quantity: 20 },
  { name: "Набір мисок 'Миска смаку'",
    description: 'Цей набір містить різноманітні миски для зберігання продуктів і приготування різних страв.',
    price: 109.99,
    quantity: 30 },
  { name: "Каструля-скороварка 'Скоринка'",
    description: 'Ця каструля-скороварка забезпечує швидке приготування страв,зберігаючи їхній смак.',
    price: 359.99,
    quantity: 5 }
]

products.each do |product_data|
  Product.create(product_data)
end
=end

# Генерація знижок
=begin
5.times do
  Discount.create(
    product_id: rand(1..10),
    percent: rand(5..30),
    start_date: Faker::Date.between(from: 6.months.ago.to_s, to: Date.today),
    end_date: Faker::Date.between(from: Date.tomorrow, to: 6.months.from_now.to_s)
  )
end
=end
