# frozen_string_literal: true

# This is the UserAddress class
class UserAddress < ApplicationRecord
  belongs_to :user

  validates :address, :city, :zip_code, :phone_number, presence: true
  validate :validate_format

  def validate_format
    validate_address_format
    validate_city_format
    validate_zip_code_format
    validate_phone_number_format
  end

  def contains_digits?(string)
    string =~ /\d/
  end

  def in_ukraine?(city)
    ukrainian_cities = [
      'Авдіївка', 'Алмазна', 'Алупка', 'Алушта', 'Алчевськ', 'Амвросіївка', 'Ананьїв', 'Андрушівка', 'Антрацит',
      'Апостолове', 'Армянськ', 'Арциз', 'Балаклія', 'Балта', 'Бар', 'Баранівка', 'Барвінкове', 'Батурин', 'Бахмач',
      'Бахмут', 'Бахчисарай', 'Баштанка', 'Белз', 'Бердичів', 'Бердянськ', 'Берегове', 'Бережани', 'Березань',
      'Березівка', 'Березне', 'Берестечко', 'Берислав', 'Бершадь', 'Бібрка', 'Біла Церква', 'Білгород-Дністровський',
      'Білицьке', 'Білогірськ', 'Білозерське', 'Білопілля', 'Біляївка', 'Благовіщенське', 'Бобринець', 'Бобровиця',
      'Богодухів', 'Богуслав', 'Боково-Хрустальне', 'Болград', 'Болехів', 'Борзна', 'Борислав', 'Бориспіль', 'Борщів',
      'Боярка', 'Бровари', 'Броди', 'Брянка', 'Бунге', 'Буринь', 'Бурштин', 'Буськ', 'Буча', 'Бучач', 'Валки',
      'Вараш', 'Василівка', 'Васильків', 'Ватутіне', 'Вашківці', 'Великі Мости', 'Верхівцеве', 'Верхньодніпровськ',
      'Вижниця', 'Вилкове', 'Винники', 'Виноградів', 'Вишгород', 'Вишневе', 'Вільногірськ', 'Вільнянськ', 'Вінниця',
      'Вовчанськ', 'Вознесенівка', 'Вознесенськ', 'Волноваха', 'Володимир', 'Волочиськ', 'Ворожба', 'Вуглегірськ',
      'Вугледар', 'Гадяч', 'Гайворон', 'Гайворон', 'Гайсин', 'Галич', 'Генічеськ', 'Герца', 'Гірник', 'Гірське',
      'Глиняни', 'Глобине', 'Глухів', 'Гнівань', 'Гола Пристань', 'Голубівка', 'Горішні Плавні', 'Горлівка',
      'Городенка', 'Городище', 'Городня', 'Городок', 'Горохів', 'Гребінка', 'Гуляйполе', 'Дебальцеве',
      'Деражня', 'Дергачі', 'Джанкой', 'Дніпро', 'Дніпрорудне',
      'Добромиль', 'Добропілля', 'Довжанськ', 'Докучаєвськ', 'Долина', 'Долинська', 'Донецьк', 'Дрогобич', 'Дружба',
      'Дружківка', 'Дубляни', 'Дубно', 'Дубровиця', 'Дунаївці', 'Енергодар', 'Євпаторія', 'Єнакієве', 'Жашків',
      'Жданівка', 'Жидачів', 'Житомир', 'Жмеринка', 'Жовква', 'Жовті Води', 'Заводське', 'Залізне',
      'Заліщики', 'Запоріжжя', 'Заставна', 'Кам\'янець-Подільський',
      'Збараж', 'Зборів', 'Звенигородка', 'Звягель', 'Здолбунів', 'Зеленодольськ', 'Зимогір\'я', 'Зіньків',
      'Зміїв', 'Знам\'янка', 'Золоте', 'Золотоноша', 'Золочів', 'Зоринськ', 'Зугрес', 'Івано-Франківськ',
      'Ізмаїл', 'Ізюм', 'Ізяслав', 'Іллінці', 'Іловайськ', 'Інкерман', 'Ірміно', 'Ірпінь', 'Іршава',
      'Ічня', 'Кагарлик', 'Кадіївка', 'Калинівка', 'Калуш', 'Кальміуське', 'Камінь-Каширський', 'Кам\'янка',
      'Кам\'янка-Бузька', 'Кам\'янка-Дніпровська', 'Кам\'янське', 'Канів', 'Карлівка', 'Каховка', 'Керч',
      'Київ', 'Кипуче', 'Ківерці', 'Кілія', 'Кіцмань', 'Кобеляки', 'Ковель', 'Кодима', 'Козятин',
      'Коломия', 'Комарно', 'Конотоп', 'Копичинці', 'Корець', 'Коростень', 'Коростишів', 'Корсунь-Шевченківський',
      'Корюківка', 'Косів', 'Костопіль', 'Костянтинівка', 'Краматорськ', 'Красилів', 'Красногорівка', 'Красноград',
      'Красноперекопськ (Яни Капу)', 'Кременець', 'Кременчук', 'Кремінна', 'Кривий Ріг', 'Кролевець', 'Кропивницький',
      'Куп\'янськ', 'Курахове', 'Ладижин', 'Ланівці', 'Лебедин', 'Лиман', 'Липовець', 'Лисичанськ',
      'Лозова', 'Лохвиця', 'Лубни', 'Луганськ', 'Лутугине', 'Луцьк', 'Львів', 'Любомль', 'Люботин',
      'Макіївка', 'Мала Виска', 'Малин', 'Марганець', 'Маріуполь', 'Мар\'їнка', 'Мелітополь', 'Мена',
      'Мерефа', 'Миколаїв', 'Миколаїв', 'Миколаївка', 'Миргород', 'Мирноград', 'Миронівка', 'Міусинськ',
      'Могилів-Подільський', 'Молодогвардійськ', 'Молочанськ', 'Монастириська', 'Монастирище', 'Моршин',
      'Моспине', 'Мостиська',
      'Мукачево', 'Надвірна', 'Немирів', 'Нетішин', 'Ніжин', 'Нікополь', 'Нова Каховка', 'Нова Одеса',
      'Новгород-Сіверський', 'Новий Буг', 'Новий Калинів', 'Новий Розділ', 'Новоазовськ', 'Нововолинськ',
      'Новогродівка', 'Новодністровськ',
      'Новодружеськ', 'Новомиргород', 'Новомосковськ', 'Новоселиця', 'Новоукраїнка', 'Новояворівськ',
      'Носівка', 'Обухів', 'Овруч', 'Одеса', 'Олевськ', 'Олександрівськ', 'Олександрія', 'Олешки', 'Оріхів',
      'Остер', 'Острог',
      'Охтирка', 'Очаків', 'Павлоград', 'Первомайськ', 'Первомайськ', 'Первомайський', 'Перевальськ',
      'Перемишляни', 'Перечин', 'Перещепине', 'Переяслав', 'Першотравенськ', 'Петрово-Красносілля',
      'Пирятин', 'Південне', 'Підгайці',
      'Підгородне', 'Погребище', 'Подільськ', 'Покров', 'Покровськ', 'Пологи', 'Полонне', 'Полтава',
      'Помічна', 'Попасна', 'Почаїв', 'Привілля', 'Прилуки', 'Приморськ', 'Прип\'ять', 'Пустомити',
      'Путивль', 'П\'ятихатки', 'Рава-Руська', 'Радехів', 'Радивилів', 'Радомишль', 'Рахів', 'Рені',
      'Решетилівка', 'Ржищів', 'Рівне', 'Ровеньки', 'Рогатин', 'Родинське', 'Рожище', 'Роздільна', 'Ромни',
      'Рубіжне', 'Рудки', 'Саки', 'Самбір', 'Сарни', 'Свалява', 'Сватове', 'Світловодськ', 'Світлодарськ',
      'Святогірськ', 'Севастополь', 'Селидове', 'Семенівка', 'Середина-Буда', 'Сєвєродонецьк', 'Синельникове',
      'Сіверськ', 'Сімферополь', 'Скадовськ', 'Скалат', 'Сквира', 'Сколе', 'Славута', 'Славутич',
      'Слов\'янськ', 'Сміла', 'Снігурівка',
      'Сніжне', 'Сновськ', 'Снятин', 'Сокаль', 'Сокиряни', 'Соледар', 'Сорокине', 'Соснівка', 'Старий Крим',
      'Старий Самбір', 'Старобільськ', 'Старокостянтинів', 'Стебник', 'Сторожинець', 'Стрий', 'Судак',
      'Судова Вишня', 'Суми', 'Суходільськ', 'Таврійськ', 'Тальне', 'Тараща', 'Татарбунари', 'Теплодар',
      'Теребовля', 'Тернівка',
      'Тернопіль', 'Тетіїв', 'Тисмениця', 'Тлумач', 'Токмак', 'Торецьк', 'Тростянець', 'Трускавець', 'Тульчин',
      'Турка', 'Тячів', 'Угнів', 'Ужгород', 'Узин', 'Українка', 'Українськ', 'Умань', 'Устилуг',
      'Фастів', 'Феодосія', 'Харків', 'Харцизьк', 'Херсон', 'Хирів', 'Хмельницький', 'Хмільник', 'Ходорів',
      'Хорол', 'Хоростків', 'Хотин', 'Хрестівка', 'Христинівка', 'Хрустальний', 'Хуст', 'Часів Яр', 'Червоноград',
      'Черкаси', 'Чернівці', 'Чернігів', 'Чигирин', 'Чистякове', 'Чоп', 'Чорнобиль', 'Чорноморськ', 'Чортків',
      'Чугуїв', 'Чуднів', 'Шаргород', 'Шахтарськ', 'Шепетівка', 'Шумськ', 'Щастя', 'Щолкіне', 'Щорс',
      'Южне', 'Южноукраїнськ', 'Южноукраїнськ', 'Яворів', 'Яготин', 'Ялта', 'Ямпіль',
      'Ямпіль (Вінницька область)', 'Яремче', 'Ясинувата'
    ]

    ukrainian_cities.include?(city)
  end

  private

  def validate_address_format
    return unless address.present? && !address.match?(/\A(?:пров\.|вул\.|пл\.|просп\.) [а-яА-ЯіІїЇєЄёЁ',\s]+, \d+\z/)

    errors.add(:address, 'Неправильний формат адреси')
  end

  def validate_city_format
    return if city.blank?

    errors.add(:city, 'Місто не повинно містити цифр') if contains_digits?(city)
    errors.add(:city, 'Місто повинно бути в Україні') unless in_ukraine?(city)
    errors.add(:city, 'Місто дуже довге (максимум 25 символів)') if city.length.to_i > 25
  end

  def validate_zip_code_format
    return unless zip_code.present? && zip_code !~ /\A\d{5}\z/

    errors.add(:zip_code, 'Поштовий код повинен містити лише цифри')
  end

  def validate_phone_number_format
    return unless phone_number.present? && (phone_number.gsub(/\s/, '') !~ /^\d{10}$/)

    errors.add(:phone_number, 'Телефонний номер повинен містити рівно та тільки 10 цифр')
  end
end
